-- phpMyAdmin SQL Dump
-- version 4.8.2
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th10 01, 2020 lúc 08:30 PM
-- Phiên bản máy phục vụ: 10.1.34-MariaDB
-- Phiên bản PHP: 7.2.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `quanly_phongkham`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `benhnhan`
--

CREATE TABLE `benhnhan` (
  `MaBN` int(10) NOT NULL,
  `HoTenBN` varchar(200) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `NamSinh` date NOT NULL,
  `SDT` varchar(13) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `CMND` int(11) NOT NULL,
  `DiaChi` varchar(250) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `EMail` varchar(200) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `NgheNghiep` varchar(100) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `GioiTinh` varchar(2) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `TrangThai` int(2) NOT NULL,
  `Log` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;

--
-- Đang đổ dữ liệu cho bảng `benhnhan`
--

INSERT INTO `benhnhan` (`MaBN`, `HoTenBN`, `NamSinh`, `SDT`, `CMND`, `DiaChi`, `EMail`, `NgheNghiep`, `GioiTinh`, `TrangThai`, `Log`) VALUES
(46, 'lê văn nam em', '0000-00-00', '0849563838', 2147483647, 'Quỳnh Tân 1 - Buôn Trấp', '', '', '0', 0, '0000-00-00 00:00:00'),
(47, 'nguyễn văn em', '2020-07-02', '02923918840', 2147483647, 'Đường Nguyễn Văn Cừ, Mỹ Khánh, Phong Điền, Cần Thơ', '', '', '0', 1, '2020-07-20 02:47:38'),
(48, 'ngô minh trọng', '0000-00-00', '0849563835', 2147483647, 'Quỳnh Tân 1 - Buôn Trấp', '', '', '0', 1, '0000-00-00 00:00:00'),
(49, 'trần văn tiên', '0000-00-00', '0392946244', 2147483647, '34/13 Nguyễn An Ninh,phường EA Tam', '', '', '0', 1, '2020-07-12 00:51:10'),
(50, 'ngô minh trọng', '0000-00-00', '0369897563', 2147483647, 'Đường Nguyễn Văn Cừ, Mỹ Khánh, Phong Điền, Cần Thơ', '', '', '0', 1, '2020-07-11 17:40:25'),
(51, 'ngô minh trọng', '0000-00-00', '01692946244', 222222, 'Đường Nguyễn Văn Cừ, Mỹ Khánh, Phong Điền, Cần Thơ', '', '', '0', 1, '0000-00-00 00:00:00'),
(52, 'ngô minh trọng', '0000-00-00', '0136265165464', 22222222, 'Quỳnh Tân 1 - Buôn Trấp', '', '', '0', 1, '0000-00-00 00:00:00'),
(53, 'ngô minh trọng', '0000-00-00', '03335153151', 22222222, 'Đường Nguyễn Văn Cừ, Mỹ Khánh, Phong Điền, Cần Thơ', '', '', '0', 1, '0000-00-00 00:00:00'),
(54, 'Hồ Viết Hoàng', '0000-00-00', '0999999999', 2147483647, 'Đường Nguyễn Văn Cừ, Mỹ Khánh, Phong Điền, Cần Thơ', '', '', '0', 1, '2020-07-19 01:44:49'),
(55, 'lê văn tuấn', '0000-00-00', '1111111111111', 2147483647, 'Đường Nguyễn Văn Cừ, Mỹ Khánh, Phong Điền, Cần Thơ', '', '', '0', 1, '2020-07-19 16:19:14'),
(56, 'ngô minh trọng', '0000-00-00', '02923918846', 2147483647, 'nguyễn an ninh', '', '', '0', 1, '2020-07-19 17:08:57'),
(57, 'lê văn vũ', '2020-07-03', '0369897567', 222222, 'Đường Nguyễn Văn Cừ, Mỹ Khánh, Phong Điền, Cần Thơ', '', '', '0', 1, '2020-07-24 00:29:47'),
(71, 'nguyễn văn c', '2020-07-31', '0392946245', 222222, '34/13 Nguyễn An Ninh,phường EA Tam', '', '', '1', 1, '2020-07-31 17:15:28'),
(72, 'Lê Thị Hà Nhôn', '2020-08-13', '39566334', 222222, 'Quỳnh Tân 1 - Buôn Trấp', '', '', '0', 1, '2020-08-02 02:11:15'),
(73, 'LÊ Thanh Tú', '2020-08-02', '0123468', 222222, 'Quỳnh Tân 1 - Buôn Trấp', '', '', '0', 1, '0000-00-00 00:00:00'),
(74, 'Nguyễn Thị Như', '2020-09-11', '0392946299', 241468333, 'Thành Phố Buôn Me Thuột', '', '', '1', 1, '2020-09-25 14:23:46');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `chitiet_donkinh`
--

CREATE TABLE `chitiet_donkinh` (
  `ID` int(11) NOT NULL,
  `IdBN` int(11) NOT NULL,
  `LoaiTrong` varchar(150) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `NgayKham` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;

--
-- Đang đổ dữ liệu cho bảng `chitiet_donkinh`
--

INSERT INTO `chitiet_donkinh` (`ID`, `IdBN`, `LoaiTrong`, `NgayKham`) VALUES
(6, 47, '', '2020-09-14 16:22:17'),
(6, 47, '', '2020-09-14 16:22:17'),
(6, 47, '', '2020-09-14 16:22:17'),
(6, 47, '', '2020-09-14 16:22:18'),
(7, 47, 'đơn tròng', '2020-09-14 16:23:43'),
(7, 47, 'áp tròng', '2020-09-14 16:23:43'),
(7, 47, 'nhựa tổng hợp', '2020-09-14 16:23:43'),
(7, 47, 'không màu', '2020-09-14 16:23:43'),
(8, 57, 'đơn tròng', '2020-09-14 16:26:25'),
(8, 57, 'phân cực', '2020-09-14 16:26:25'),
(8, 57, 'không màu', '2020-09-14 16:26:25'),
(10, 49, 'đơn tròng', '2020-09-19 02:45:52'),
(10, 49, 'hai tròng', '2020-09-19 02:45:52'),
(10, 49, 'có màu', '2020-09-19 02:45:52'),
(13, 47, 'đơn tròng', '2020-09-19 09:00:42'),
(13, 47, 'phân cực', '2020-09-19 09:00:43'),
(13, 47, 'mắt màu', '2020-09-19 09:00:43'),
(13, 47, 'có màu', '2020-09-19 09:00:43'),
(14, 47, 'áp tròng', '2020-09-19 15:49:03'),
(14, 47, 'hai tròng', '2020-09-19 15:49:03'),
(14, 47, 'phân cực', '2020-09-19 15:49:03'),
(14, 47, 'có màu', '2020-09-19 15:49:03'),
(15, 47, 'hai tròng', '2020-09-20 09:54:03'),
(15, 47, 'phân cực', '2020-09-20 09:54:03'),
(15, 47, 'có màu', '2020-09-20 09:54:03');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `chitiet_donthuoc`
--

CREATE TABLE `chitiet_donthuoc` (
  `ID` int(11) NOT NULL,
  `IdBN` int(11) NOT NULL,
  `TenThuoc` varchar(100) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `DonVi` varchar(30) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `SoLuong` int(11) NOT NULL,
  `DonGia` int(11) NOT NULL,
  `ThanhTien` varchar(20) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `CachDung` varchar(250) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `NgayKham` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;

--
-- Đang đổ dữ liệu cho bảng `chitiet_donthuoc`
--

INSERT INTO `chitiet_donthuoc` (`ID`, `IdBN`, `TenThuoc`, `DonVi`, `SoLuong`, `DonGia`, `ThanhTien`, `CachDung`, `NgayKham`) VALUES
(23, 49, 'panadol1', 'viên', 3, 10000, '30000', 'sáng 2 viên', '2020-07-09 02:37:21'),
(23, 49, 'becberin', 'lọ', 4, 20000, '80000', 'tối 3 viên', '2020-07-09 02:37:22'),
(23, 49, 'panadol3', 'viên', 5, 2000, '10000', 'chiều1 viên', '2020-07-09 02:37:22'),
(24, 49, 'panadol1', 'viên', 3, 10000, '30000', 'sáng 2 viên', '2020-07-09 02:43:00'),
(24, 49, 'becberin', 'lọ', 4, 20000, '80000', 'tối 3 viên', '2020-07-09 02:43:00'),
(24, 49, 'panadol3', 'viên', 5, 2000, '10000', 'chiều1 viên', '2020-07-09 02:43:00'),
(25, 47, 'panadol3', 'viên', 2, 2000, '4000', 'chiều1 viên', '2020-07-10 01:18:00'),
(25, 47, 'becberin', 'lọ', 3, 20000, '60000', 'tối 3 viên', '2020-07-10 01:18:00'),
(26, 47, 'panadol1', 'viên', 2, 10000, '20000', 'sáng 2 viên', '2020-07-12 12:57:08'),
(26, 47, 'becberin', 'lọ', 3, 20000, '60000', 'tối 3 viên', '2020-07-12 12:57:08'),
(26, 47, 'panadol3', 'viên', 52, 2000, '104000', 'chiều1 viên', '2020-07-12 12:57:08'),
(27, 47, 'panadol1', 'viên', 2, 10000, '20000', 'sáng 2 viên', '2020-07-12 14:37:06'),
(27, 47, 'becberin', 'lọ', 3, 20000, '60000', 'tối 3 viên', '2020-07-12 14:37:06'),
(27, 47, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-07-12 14:37:06'),
(28, 47, 'panadol1', 'viên', 10, 10000, '100000', 'sáng 2 viên', '2020-07-12 15:06:16'),
(28, 47, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-07-12 15:06:16'),
(28, 47, 'panadol5', 'vien', 4, 2000, '8000', 'trưa 2 viên', '2020-07-12 15:06:16'),
(0, 47, 'panadol1', 'viên', 2, 10000, '20000', 'sáng 2 viên', '2020-07-19 22:33:25'),
(0, 47, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-07-19 22:33:25'),
(0, 47, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-07-19 22:33:25'),
(30, 49, 'becberin', 'lọ', 5, 20000, '100000', 'tối 3 viên', '2020-07-19 22:38:22'),
(30, 49, 'panadol3', 'viên', 5, 2000, '10000', 'chiều1 viên', '2020-07-19 22:38:22'),
(30, 49, 'panadol1', 'viên', 5, 10000, '50000', 'sáng 2 viên', '2020-07-19 22:38:22'),
(31, 47, 'panadol2', 'lọ', 1, 20000, '20000', 'tối 1 viên', '2020-07-19 22:42:40'),
(31, 47, 'becberin', 'lọ', 1, 20000, '20000', 'tối 3 viên', '2020-07-19 22:42:41'),
(31, 47, 'FANADOL', 'viên', 1, 2000, '2000', 'tối 3 viên', '2020-07-19 22:42:41'),
(32, 54, 'panadol3', 'viên', 2, 2000, '4000', 'chiều1 viên', '2020-07-19 22:44:38'),
(32, 54, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-07-19 22:44:38'),
(32, 54, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-07-19 22:44:38'),
(33, 55, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-07-19 22:46:56'),
(33, 55, 'becberin', 'lọ', 1, 20000, '20000', 'tối 3 viên', '2020-07-19 22:46:57'),
(33, 55, 'panadol5', 'vien', 1, 2000, '2000', 'trưa 2 viên', '2020-07-19 22:46:57'),
(34, 55, 'panadol3', 'viên', 2, 2000, '4000', 'chiều1 viên', '2020-07-19 22:48:47'),
(34, 55, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-07-19 22:48:48'),
(34, 55, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-07-19 22:48:48'),
(35, 47, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-07-22 00:16:38'),
(35, 47, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-07-22 00:16:38'),
(35, 47, 'panadol5', 'vien', 2, 2000, '4000', 'trưa 2 viên', '2020-07-22 00:16:39'),
(36, 49, 'panadol3', 'viên', 2, 2000, '4000', 'chiều1 viên', '2020-07-22 00:17:24'),
(36, 49, 'becberin', 'lọ', 3, 20000, '60000', 'tối 3 viên', '2020-07-22 00:17:25'),
(37, 47, 'panadol3', 'viên', 2, 2000, '4000', 'chiều1 viên', '2020-07-22 12:05:37'),
(37, 47, 'becberin', 'lọ', 3, 20000, '60000', 'tối 3 viên', '2020-07-22 12:05:37'),
(37, 47, 'FANADOL2', 'viên', 5, 5500, '27500', 'sáng 1 viên', '2020-07-22 12:05:37'),
(37, 47, 'FANADOL', 'viên', 6, 2000, '12000', 'tối 3 viên', '2020-07-22 12:05:37'),
(38, 49, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-07-22 15:38:08'),
(38, 49, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-07-22 15:38:09'),
(38, 49, 'panadol5', 'vien', 1, 2000, '2000', 'trưa 2 viên', '2020-07-22 15:38:09'),
(38, 49, 'panadol3', 'viên', 5, 2000, '10000', 'chiều1 viên', '2020-07-22 15:38:09'),
(39, 47, 'panadol3', 'viên', 2, 2000, '4000', 'chiều1 viên', '2020-07-23 18:48:18'),
(39, 47, 'becberin', 'lọ', 4, 20000, '80000', 'tối 3 viên', '2020-07-23 18:48:18'),
(39, 47, 'FANADOL', 'viên', 6, 2000, '12000', 'tối 3 viên', '2020-07-23 18:48:18'),
(39, 47, 'panadol1', 'viên', 0, 10000, '0', '', '2020-07-25 22:46:01'),
(39, 47, 'panadol3', 'viên', 0, 2000, '0', '', '2020-07-25 22:46:01'),
(39, 47, 'panadol4', 'lo', 0, 2000, '0', '', '2020-07-25 22:46:01'),
(40, 47, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-07-25 23:11:22'),
(40, 47, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-07-25 23:11:23'),
(40, 47, 'panadol5', 'vien', 1, 2000, '2000', 'trưa 2 viên', '2020-07-25 23:11:23'),
(41, 47, 'panadol2', 'lọ', 4, 20000, '80000', 'sáng 1 viên', '2020-07-26 01:59:13'),
(41, 47, 'FANADOL', 'viên', 5, 2000, '10000', 'tối 1 viên', '2020-07-26 01:59:13'),
(41, 47, 'panadol5', 'vien', 6, 2000, '12000', 'trưa 1 viên', '2020-07-26 01:59:13'),
(42, 48, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-07-26 02:00:53'),
(42, 48, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 1 viên', '2020-07-26 02:00:53'),
(42, 48, 'panadol5', 'vien', 2, 2000, '4000', 'trưa 2 viên', '2020-07-26 02:00:53'),
(43, 47, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-07-26 02:03:39'),
(43, 47, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 1 viên', '2020-07-26 02:03:40'),
(43, 47, 'panadol5', 'vien', 2, 2000, '4000', 'trưa 2 viên', '2020-07-26 02:03:40'),
(44, 49, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-07-29 03:21:49'),
(44, 49, 'FANADOL', 'viên', 3, 2000, '6000', 'tối 3 viên', '2020-07-29 03:21:49'),
(44, 49, 'panadol5', 'vien', 4, 2000, '8000', 'trưa 2 viên', '2020-07-29 03:21:49'),
(44, 49, 'becberin', 'lọ', 1, 20000, '20000', 'tối 3 viên', '2020-07-29 03:21:50'),
(46, 49, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-07-29 03:26:23'),
(46, 49, 'FANADOL', 'viên', 3, 2000, '6000', 'tối 3 viên', '2020-07-29 03:26:23'),
(46, 49, 'panadol5', 'vien', 4, 2000, '8000', 'trưa 2 viên', '2020-07-29 03:26:23'),
(47, 54, 'panadol2', 'lọ', 1, 20000, '20000', 'tối 1 viên', '2020-07-29 03:29:35'),
(47, 54, 'becberin', 'lọ', 1, 20000, '20000', 'tối 3 viên', '2020-07-29 03:29:35'),
(47, 54, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-07-29 03:29:35'),
(48, 55, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-07-29 03:34:17'),
(48, 55, 'becberin', 'lọ', 1, 20000, '20000', 'tối 3 viên', '2020-07-29 03:34:17'),
(48, 55, 'FANADOL', 'viên', 1, 2000, '2000', 'tối 3 viên', '2020-07-29 03:34:17'),
(49, 49, 'panadol3', 'viên', 1, 2000, '2000', 'chiều1 viên', '2020-07-31 17:20:06'),
(49, 49, 'becberin', 'lọ', 1, 20000, '20000', 'tối 3 viên', '2020-07-31 17:20:07'),
(83, 47, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-01 16:57:09'),
(83, 47, 'becberin', 'lọ', 3, 20000, '60000', 'tối 3 viên', '2020-08-01 16:57:09'),
(83, 47, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 1 viên', '2020-08-01 16:57:09'),
(85, 48, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-02 01:02:06'),
(85, 48, 'panadol3', 'viên', 3, 2000, '6000', 'chiều1 viên', '2020-08-02 01:02:07'),
(85, 48, 'panadol1', 'viên', 4, 10000, '40000', 'sáng 2 viên', '2020-08-02 01:02:07'),
(88, 55, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-08-02 01:16:33'),
(88, 55, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-02 01:16:33'),
(88, 55, 'panadol5', 'vien', 1, 2000, '2000', 'trưa 2 viên', '2020-08-02 01:16:33'),
(88, 55, 'becberin', 'lọ', 3, 20000, '60000', 'tối 3 viên', '2020-08-02 01:16:33'),
(89, 71, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-02 01:28:47'),
(89, 71, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-02 01:28:47'),
(89, 71, 'panadol5', 'vien', 1, 2000, '2000', 'trưa 2 viên', '2020-08-02 01:28:47'),
(89, 71, 'becberin', 'lọ', 3, 20000, '60000', 'tối 3 viên', '2020-08-02 01:28:48'),
(89, 71, 'FANADOL2', 'viên', 5, 5500, '27500', 'sáng 1 viên', '2020-08-02 01:28:48'),
(90, 49, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-08-02 01:48:27'),
(90, 49, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-02 01:48:27'),
(90, 49, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-02 01:48:27'),
(90, 49, 'FANADOL2', 'viên', 5, 5500, '27500', 'sáng 1 viên', '2020-08-02 01:48:27'),
(91, 72, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-02 02:12:01'),
(91, 72, 'becberin', 'lọ', 1, 20000, '20000', 'tối 3 viên', '2020-08-02 02:12:01'),
(91, 72, 'FANADOL', 'viên', 3, 2000, '6000', 'tối 3 viên', '2020-08-02 02:12:02'),
(92, 49, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-12 22:59:41'),
(92, 49, 'panadol5', 'vien', 4, 2000, '8000', 'trưa 2 viên', '2020-08-12 22:59:42'),
(94, 49, 'FANADOL', 'viên', 1, 2000, '2000', 'tối 3 viên', '2020-08-12 23:20:00'),
(94, 49, 'panadol5', 'vien', 1, 2000, '2000', 'trưa 2 viên', '2020-08-12 23:20:00'),
(96, 48, 'panadol3', 'viên', 1, 2000, '2000', 'chiều1 viên', '2020-08-12 23:22:50'),
(96, 48, 'becberin', 'lọ', 1, 20000, '20000', 'tối 3 viên', '2020-08-12 23:22:50'),
(96, 48, 'FANADOL', 'viên', 1, 2000, '2000', 'tối 3 viên', '2020-08-12 23:22:50'),
(97, 71, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-12 23:25:23'),
(97, 71, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-12 23:25:23'),
(98, 57, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-12 23:28:16'),
(98, 57, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-12 23:28:16'),
(98, 57, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-12 23:28:16'),
(99, 57, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-12 23:42:46'),
(99, 57, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-12 23:42:47'),
(100, 57, 'panadol2', 'lọ', 1, 20000, '20000', 'tối 1 viên', '2020-08-12 23:45:42'),
(100, 57, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-12 23:45:43'),
(100, 57, 'panadol5', 'vien', 1, 2000, '2000', 'trưa 2 viên', '2020-08-12 23:45:43'),
(127, 47, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-08-13 01:05:54'),
(127, 47, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-13 01:05:54'),
(127, 47, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 1 viên', '2020-08-13 01:05:54'),
(128, 48, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-08-13 01:07:40'),
(128, 48, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-13 01:07:40'),
(128, 48, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-13 01:07:40'),
(129, 48, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-08-13 01:08:25'),
(129, 48, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-13 01:08:25'),
(129, 48, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-13 01:08:25'),
(130, 54, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-08-13 01:16:55'),
(130, 54, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-13 01:16:55'),
(130, 54, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-13 01:16:55'),
(156, 47, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-14 15:40:21'),
(156, 47, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-14 15:40:21'),
(156, 47, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-14 15:40:21'),
(157, 54, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-14 16:38:54'),
(157, 54, 'becberin', 'lọ', 5, 20000, '100000', 'tối 3 viên', '2020-08-14 16:38:54'),
(157, 54, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-14 16:38:54'),
(187, 47, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-14 17:03:55'),
(187, 47, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-14 17:03:55'),
(187, 47, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-14 17:03:55'),
(188, 50, 'panadol2', 'lọ', 2, 20000, '40000', '', '2020-08-14 17:59:03'),
(188, 50, 'becberin', 'lọ', 3, 20000, '60000', '', '2020-08-14 17:59:04'),
(188, 50, 'FANADOL', 'viên', 2, 2000, '4000', '', '2020-08-14 17:59:04'),
(189, 47, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-14 23:50:25'),
(189, 47, 'FANADOL', 'viên', 1, 2000, '2000', 'tối 3 viên', '2020-08-14 23:50:25'),
(195, 47, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-15 00:05:40'),
(195, 47, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-15 00:05:40'),
(196, 47, 'panadol2', 'lọ', 2, 20000, '40000', 'tối 1 viên', '2020-08-15 04:16:01'),
(196, 47, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-15 04:16:01'),
(196, 47, 'FANADOL2', 'viên', 2, 5500, '11000', 'sáng 1 viên', '2020-08-15 04:16:01'),
(197, 47, 'panadol3', 'viên', 2, 2000, '4000', 'chiều1 viên', '2020-08-15 04:18:07'),
(197, 47, 'becberin', 'lọ', 4, 20000, '80000', 'tối 3 viên', '2020-08-15 04:18:07'),
(197, 47, 'FANADOL', 'viên', 5, 2000, '10000', 'tối 3 viên', '2020-08-15 04:18:07'),
(203, 47, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-15 04:26:59'),
(203, 47, 'becberin', 'lọ', 5, 20000, '100000', 'tối 3 viên', '2020-08-15 04:26:59'),
(203, 47, 'FANADOL', 'viên', 6, 2000, '12000', 'tối 3 viên', '2020-08-15 04:26:59'),
(203, 47, 'panadol1', 'viên', 2, 10000, '20000', 'sáng 2 viên', '2020-08-15 04:26:59'),
(207, 55, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-15 04:32:20'),
(207, 55, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-15 04:32:20'),
(207, 55, 'FANADOL', 'viên', 2, 2000, '4000', 'tối 3 viên', '2020-08-15 04:32:20'),
(207, 55, 'panadol1', 'viên', 4, 10000, '40000', 'sáng 2 viên', '2020-08-15 04:32:20'),
(209, 47, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-08-15 09:10:44'),
(209, 47, 'becberin', 'lọ', 2, 20000, '40000', 'tối 3 viên', '2020-08-15 09:10:44'),
(209, 47, 'FANADOL', 'viên', 1, 2000, '2000', 'tối 1 viên', '2020-08-15 09:10:44'),
(210, 47, 'panadol2', 'lọ', 4, 20000, '80000', 'tối 1 viên', '2020-09-19 02:42:02'),
(210, 47, 'becberin', 'lọ', 3, 20000, '60000', 'tối 3 viên', '2020-09-19 02:42:02'),
(210, 47, 'FANADOL', 'viên', 1, 2000, '2000', 'tối 3 viên', '2020-09-19 02:42:02'),
(211, 49, 'panadol2', 'lọ', 2, 20000, '40000', 'sáng 2 viên, tối 2 viên', '2020-09-19 15:29:59'),
(211, 49, 'becberin', 'lọ', 2, 20000, '40000', 'sáng 2 viên, tối 2 viên', '2020-09-19 15:30:00'),
(211, 49, 'panadol5', 'vien', 1, 2000, '2000', 'sáng 2 viên, tối 1 viên', '2020-09-19 15:30:00'),
(211, 49, 'panadol1', 'viên', 5, 10000, '50000', 'sáng 2 viên, tối 1 viên', '2020-09-19 15:30:00'),
(212, 47, 'Oxytetraciclin', 'lọ', 1, 55000, '55000', 'nhỏ mắt 3 lần 1 ngày', '2020-09-25 12:23:55'),
(212, 47, 'becberin', 'lọ', 1, 20000, '20000', 'sáng 2 viên, tối 2 viên', '2020-09-25 12:23:56'),
(212, 47, 'Mintacol', 'VỈ', 1, 55000, '55000', 'sáng 2 viên, tối 2 viên', '2020-09-25 12:23:56'),
(213, 47, 'Miconazole', 'viên', 10, 2000, '20000', 'sáng 2 viên tối 2 viên', '2020-09-28 04:13:59'),
(213, 47, 'clindamycin', 'viên', 10, 2000, '20000', 'sáng 2 viên tối 2 viên', '2020-09-28 04:13:59'),
(213, 47, 'Tobramycin', 'lo', 10, 2000, '20000', 'sáng 2 viên tối 2 viên', '2020-09-28 04:13:59');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `donkinh`
--

CREATE TABLE `donkinh` (
  `ID` int(11) NOT NULL,
  `IdBN` int(11) NOT NULL,
  `Id_nhanvien` int(11) NOT NULL,
  `GhiChu` varchar(250) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `TaiKham` datetime NOT NULL,
  `MT_SP` varchar(15) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MT_CY` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MT_AXE` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MT_VA` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MT_AD` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MT_KC` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MT_KQ` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MP_SP` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MP_CY` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MP_AXE` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MP_VA` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MP_AD` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MP_KC` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `MP_KQ` varchar(10) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `NgayKeDon` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;

--
-- Đang đổ dữ liệu cho bảng `donkinh`
--

INSERT INTO `donkinh` (`ID`, `IdBN`, `Id_nhanvien`, `GhiChu`, `TaiKham`, `MT_SP`, `MT_CY`, `MT_AXE`, `MT_VA`, `MT_AD`, `MT_KC`, `MT_KQ`, `MP_SP`, `MP_CY`, `MP_AXE`, `MP_VA`, `MP_AD`, `MP_KC`, `MP_KQ`, `NgayKeDon`) VALUES
(1, 47, 0, 'không nhìn đọc quá gần.', '2020-09-30 00:00:00', '-0,25', '-0,25', '-0,25', '-0,25', '-0,25', '1', '', '-0,25', '-0,25', '-0,25', '-0,25', '-0,25', '2', '', '2020-09-14 04:19:51'),
(2, 47, 0, '', '0000-00-00 00:00:00', '-0,25', '1', '0,75', '-0,3', '1', '1', '', '-0,25', '-0,25', '-0,25', '-0,26', '-0,28', '2', '', '2020-09-14 15:42:45'),
(3, 47, 0, '', '0000-00-00 00:00:00', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '2020-09-14 15:47:37'),
(4, 47, 0, 'không nhìn đọc quá gần.', '2020-10-10 00:00:00', '-0,25', '-0,25', '-0,25', '-0,3', '-0,25', '1', '', '-0,25', '-0,25', '-0,25', '-0,26', '-0,25', '2', '', '2020-09-14 16:19:53'),
(5, 47, 0, 'không nhìn đọc quá gần.', '2020-10-10 00:00:00', '-0,25', '-0,25', '-0,25', '-0,3', '-0,25', '1', '', '-0,25', '-0,25', '-0,25', '-0,26', '-0,25', '2', '', '2020-09-14 16:20:26'),
(6, 47, 0, 'không nhìn đọc quá gần.', '2020-10-10 00:00:00', '-0,25', '-0,25', '-0,25', '-0,3', '-0,25', '1', '', '-0,25', '-0,25', '-0,25', '-0,26', '-0,25', '2', '', '2020-09-14 16:22:17'),
(7, 47, 0, 'không nhìn đọc quá gần.', '2020-10-10 00:00:00', '-0,25', '-0,25', '-0,25', '-0,3', '-0,25', '1', '', '-0,25', '-0,25', '-0,25', '-0,26', '-0,25', '2', '', '2020-09-14 16:23:43'),
(8, 57, 0, 'không nhìn đọc quá gần.', '2020-10-07 00:00:00', '-0,25', '1', '0,75', '-0,3', '-0,25', '1', '', '-0,25', '-0,25', '-0,27', '-0,26', '-0,28', '2', '', '2020-09-14 16:26:25'),
(9, 55, 0, '', '0000-00-00 00:00:00', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '2020-09-19 02:38:15'),
(10, 49, 0, 'không nhìn đọc quá gần.', '2020-09-30 00:00:00', '-0,25', '-0,25', '', '-0,25', '1', '1', '', '-0,25', '-0,25', '-0,27', '-0,25', '-0,25', '2', '', '2020-09-19 02:45:52'),
(11, 47, 0, '', '0000-00-00 00:00:00', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '2020-09-19 02:52:43'),
(12, 47, 0, '', '0000-00-00 00:00:00', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '2020-09-19 02:53:33'),
(13, 47, 0, 'không nhìn đọc quá gần.', '2020-09-17 00:00:00', '-0,25', '-0,25', '-0,25', '-0,25', '-0,25', '1', '', '-0,25', '-0,25', '-0,25', '-0,25', '-0,25', '2', '', '2020-09-19 09:00:42'),
(14, 47, 0, 'không nhìn đọc quá gần.', '2020-09-30 00:00:00', '-250', '-125', '16', '3/10', '100', '31', '', '+150', '-050', '175', '4/10', '100', '31', '', '2020-09-19 15:49:03'),
(15, 47, 0, 'không nhìn đọc quá gần.', '2020-09-30 00:00:00', '-0,25', '-125', '16', '3/10', '100', '1', '', '+150', '-050', '175', '4/10', '100', '', '', '2020-09-20 09:54:03');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `donthuoc`
--

CREATE TABLE `donthuoc` (
  `ID` int(10) NOT NULL,
  `IdBN` int(10) NOT NULL,
  `ChuanDoan` varchar(250) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `GhiChu` varchar(20) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `TaiKham` datetime NOT NULL,
  `GiaCuoi` int(10) NOT NULL,
  `DonMau` int(11) NOT NULL,
  `NgayKeDon` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;

--
-- Đang đổ dữ liệu cho bảng `donthuoc`
--

INSERT INTO `donthuoc` (`ID`, `IdBN`, `ChuanDoan`, `GhiChu`, `TaiKham`, `GiaCuoi`, `DonMau`, `NgayKeDon`) VALUES
(30, 49, 'rối loạn tiêu hóa3', 'không được uống bia ', '2020-07-22 00:00:00', 160000, 1, '2020-07-19 22:38:22'),
(31, 47, 'viêm vai gáy', 'tránh mang vác vật n', '2020-08-01 00:00:00', 42000, 1, '2020-07-19 22:42:40'),
(32, 54, 'viêm họng2', 'không nên sử dụng đồ', '2020-08-11 00:00:00', 48000, 1, '2020-07-19 22:44:38'),
(33, 55, 'viêm xoang', 'tránh nơi có không k', '2020-08-03 00:00:00', 102000, 1, '2020-07-19 22:46:56'),
(34, 55, 'rối loạn tiêu hóa', 'không được uống bia ', '2020-08-05 00:00:00', 48000, 1, '2020-07-19 22:48:47'),
(35, 47, 'Đau dạ dày', 'không được uống bia ', '2020-08-01 00:00:00', 48000, 1, '2020-07-22 00:16:38'),
(36, 49, 'viêm họng1', '', '2020-09-07 00:00:00', 64000, 1, '2020-07-22 00:17:24'),
(37, 47, 'đau mắt đỏ', 'không được uống bia ', '2020-08-10 00:00:00', 103500, 1, '2020-07-22 12:05:37'),
(38, 49, 'Đau dạ dày', 'không được uống bia ', '2020-09-10 00:00:00', 96000, 0, '2020-04-16 15:38:08'),
(39, 47, 'đục thủy tinh thể', 'không được uống bia ', '0000-00-00 00:00:00', 0, 1, '2020-03-10 18:48:18'),
(40, 47, 'viên họng', 'không được uống bia ', '2020-09-05 00:00:00', 86000, 0, '2020-07-25 23:11:22'),
(41, 47, 'viêm vai gáy', 'không được uống bia ', '0000-00-00 00:00:00', 102000, 0, '2020-07-26 01:59:12'),
(42, 48, 'đau mắt cấp tính', 'không được uống bia ', '2020-08-19 00:00:00', 48000, 0, '2020-07-26 02:00:53'),
(43, 47, 'đau dạ dày', 'không được uống bia ', '0000-00-00 00:00:00', 48000, 0, '2020-07-26 02:03:39'),
(44, 49, 'đau dạ dày', 'không được uống bia ', '0000-00-00 00:00:00', 74000, 0, '2020-07-29 03:21:49'),
(45, 49, 'đau dạ dày', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-02-03 03:25:30'),
(46, 49, 'đau dạ dày', 'không được uống bia ', '0000-00-00 00:00:00', 54000, 0, '2020-07-29 03:26:23'),
(47, 54, 'đau dạ dày', 'không được uống bia ', '0000-00-00 00:00:00', 44000, 0, '2020-07-29 03:29:34'),
(48, 55, 'viêm vai gáy', 'tránh mang vác vật n', '0000-00-00 00:00:00', 62000, 0, '2020-07-29 03:34:17'),
(49, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 22000, 0, '2020-07-31 17:20:06'),
(50, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:21:58'),
(51, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-01-02 17:23:48'),
(52, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-12-13 17:23:50'),
(53, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-11-03 17:24:00'),
(54, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-10-02 17:24:08'),
(55, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:25:29'),
(56, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:25:39'),
(57, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:26:40'),
(58, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:26:53'),
(59, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:27:24'),
(60, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:27:52'),
(61, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:31:20'),
(62, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:32:02'),
(63, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:32:19'),
(64, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:33:27'),
(65, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:37:12'),
(66, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:37:36'),
(67, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:37:58'),
(68, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:38:26'),
(69, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:39:49'),
(70, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:40:38'),
(71, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:42:16'),
(72, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:42:30'),
(73, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:43:13'),
(74, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:43:47'),
(75, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:45:18'),
(76, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:45:29'),
(77, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:47:29'),
(78, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:48:22'),
(79, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:48:55'),
(80, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:50:29'),
(81, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:51:15'),
(82, 49, 'viên họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-07-31 17:51:38'),
(83, 47, 'viêm vai gáy', 'không được uống bia ', '0000-00-00 00:00:00', 144000, 0, '2020-08-01 16:57:09'),
(84, 47, 'viêm vai gáy', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-02 00:46:17'),
(85, 48, 'viêm dạ dày', 'không được uống bia ', '0000-00-00 00:00:00', 86000, 0, '2020-08-02 01:02:06'),
(86, 48, 'viêm dạ dày', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-02 01:05:00'),
(87, 48, 'viêm dạ dày', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-02 01:05:40'),
(88, 55, 'viêm họng', 'không được uống bia ', '0000-00-00 00:00:00', 106000, 0, '2020-08-02 01:16:32'),
(89, 71, 'd', 'không được uống bia ', '0000-00-00 00:00:00', 173500, 0, '2020-08-02 01:28:47'),
(90, 49, 'viêm vai gáy', 'tái khám sau năm ngà', '0000-00-00 00:00:00', 111500, 0, '2020-08-02 01:48:27'),
(91, 72, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 106000, 0, '2020-08-02 02:12:01'),
(92, 49, 'đau dạ dày', 'không được uống bia ', '0000-00-00 00:00:00', 12000, 0, '2020-08-12 22:59:41'),
(93, 49, 'đau dạ dày', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-12 23:03:12'),
(94, 49, 'đau dạy dày', 'không được uống bia ', '0000-00-00 00:00:00', 4000, 0, '2020-08-12 23:20:00'),
(95, 49, 'đau dạy dày', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-12 23:22:00'),
(96, 48, 'viêm họng', 'không được uống bia ', '0000-00-00 00:00:00', 24000, 0, '2020-08-12 23:22:50'),
(97, 71, 'viêm vai gáy', 'không được uống bia ', '0000-00-00 00:00:00', 44000, 0, '2020-08-12 23:25:23'),
(98, 57, 'viêm', '', '0000-00-00 00:00:00', 124000, 0, '2020-08-12 23:28:16'),
(99, 57, 'đau xương khớp', 'tránh mang vác vật n', '0000-00-00 00:00:00', 84000, 0, '2020-08-12 23:42:46'),
(100, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 26000, 0, '2020-08-12 23:45:42'),
(101, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-12 23:46:44'),
(102, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-12 23:47:12'),
(103, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:25:33'),
(104, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:30:45'),
(105, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:32:25'),
(106, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:33:05'),
(107, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:33:24'),
(108, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:34:02'),
(109, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:43:01'),
(110, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:43:22'),
(111, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:49:34'),
(112, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:49:59'),
(113, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:50:35'),
(114, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:53:30'),
(115, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:56:53'),
(116, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:57:46'),
(117, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:58:08'),
(118, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:58:39'),
(119, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:58:55'),
(120, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:59:08'),
(121, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:59:29'),
(122, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 00:59:52'),
(123, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:01:36'),
(124, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:02:19'),
(125, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:02:57'),
(126, 57, 'Đau bao tử', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:03:51'),
(127, 47, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 84000, 0, '2020-08-13 01:05:54'),
(128, 48, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 84000, 0, '2020-08-13 01:07:40'),
(129, 48, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 84000, 0, '2020-08-13 01:08:25'),
(130, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 84000, 0, '2020-08-13 01:16:55'),
(131, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:18:31'),
(132, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:19:11'),
(133, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:19:30'),
(134, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:21:11'),
(135, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:22:33'),
(136, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:23:38'),
(137, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:23:52'),
(138, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:26:27'),
(139, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:27:31'),
(140, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:27:48'),
(141, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:28:36'),
(142, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:29:22'),
(143, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:29:25'),
(144, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:29:35'),
(145, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:30:27'),
(146, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:31:38'),
(147, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:31:59'),
(148, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:32:54'),
(149, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:33:07'),
(150, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:36:00'),
(151, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:36:12'),
(152, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:37:44'),
(153, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:38:17'),
(154, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:39:18'),
(155, 54, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-13 01:39:49'),
(156, 47, 'buhbjhb', 'không được uống bia ', '0000-00-00 00:00:00', 124000, 0, '2020-08-14 15:40:21'),
(157, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 184000, 0, '2020-08-14 16:38:53'),
(158, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:43:48'),
(159, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:44:18'),
(160, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:45:03'),
(161, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:46:20'),
(162, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:48:27'),
(163, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:49:14'),
(164, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:49:29'),
(165, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:49:50'),
(166, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:49:54'),
(167, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:50:04'),
(168, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:50:48'),
(169, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:51:23'),
(170, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:52:49'),
(171, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:53:12'),
(172, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:53:23'),
(173, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:54:26'),
(174, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:54:32'),
(175, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:54:52'),
(176, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:55:24'),
(177, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:56:54'),
(178, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:57:45'),
(179, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:58:19'),
(180, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 16:59:47'),
(181, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 17:00:39'),
(182, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 17:00:49'),
(183, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 17:01:00'),
(184, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 17:01:30'),
(185, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 17:02:09'),
(186, 54, 'viêm họng', 'không được uống đồ đ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 17:02:35'),
(187, 47, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 124000, 0, '2020-08-14 17:03:55'),
(188, 50, 'v', '', '0000-00-00 00:00:00', 104000, 0, '2020-08-14 17:59:03'),
(189, 47, 'viêm ruột', 'không được uống bia ', '0000-00-00 00:00:00', 82000, 0, '2020-08-14 23:50:25'),
(190, 47, 'viêm ruột', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-14 23:54:08'),
(191, 47, 'viêm ruột', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-15 00:01:30'),
(192, 47, 'viêm ruột', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-15 00:03:23'),
(193, 47, 'viêm ruột', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-15 00:05:02'),
(194, 47, 'viêm ruột', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-15 00:05:05'),
(195, 47, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 84000, 0, '2020-08-15 00:05:40'),
(196, 47, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 55000, 0, '2020-08-15 04:16:01'),
(197, 47, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 94000, 0, '2020-08-15 04:18:07'),
(198, 47, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-15 04:18:59'),
(199, 47, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-15 04:22:22'),
(200, 47, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-15 04:23:07'),
(201, 47, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-15 04:23:36'),
(202, 47, 'v', 'không được uống bia ', '0000-00-00 00:00:00', 0, 0, '2020-08-15 04:24:22'),
(203, 47, 'V', 'vệ sinh răng miệng t', '0000-00-00 00:00:00', 212000, 0, '2020-08-15 04:26:58'),
(204, 47, 'V', 'vệ sinh răng miệng t', '0000-00-00 00:00:00', 0, 0, '2020-08-15 04:29:05'),
(210, 47, 'viêm vai gáy', 'tránh mang vác vật n', '0000-00-00 00:00:00', 142000, 0, '2020-09-19 02:42:02'),
(211, 49, 'viêm xoang', 'tránh nơi có không k', '0000-00-00 00:00:00', 132000, 1, '2020-09-19 15:29:59'),
(212, 47, 'Viêm mắt thể mi', 'uống thuốc đều đặn', '0000-00-00 00:00:00', 130000, 1, '2020-09-25 12:23:55'),
(213, 47, 'đau mắt', 'nhỏ thuốc mắt thường', '0000-00-00 00:00:00', 60000, 1, '2020-09-28 04:13:59');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `khothuoc`
--

CREATE TABLE `khothuoc` (
  `id` int(10) UNSIGNED NOT NULL,
  `TenThuoc` varchar(200) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `DonViTinh` varchar(50) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `DonGia` int(10) NOT NULL,
  `GiaNhap` int(10) NOT NULL,
  `SoLuong` int(10) NOT NULL,
  `TrangThai` int(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;

--
-- Đang đổ dữ liệu cho bảng `khothuoc`
--

INSERT INTO `khothuoc` (`id`, `TenThuoc`, `DonViTinh`, `DonGia`, `GiaNhap`, `SoLuong`, `TrangThai`) VALUES
(1, 'amphotericin', 'viên', 1000000, 95000, 0, 1),
(2, 'cefazolin', 'lọ', 20000, 1500, 181, 1),
(3, 'clindamycin', 'viên', 2000, 0, 88, 1),
(4, 'panadol1', 'viên', 10000, 9000, 14, 1),
(5, 'panadol2', 'lọ', 20000, 18000, 141, 1),
(6, 'Miconazole', 'viên', 2000, 1800, 9, 1),
(7, 'Tobramycin', 'lo', 2000, 1600, 30, 1),
(8, 'loratadin', 'vien', 2000, 1900, 64, 1),
(9, 'Gentamincin', 'viên', 5500, 5000, 183, 1),
(10, 'Thuốc nhỏ mắt Atropin', 'lọ', 20000, 15000, 150, 1),
(11, 'Thuốc tra mắt Homatropin ', 'lọ', 80000, 70000, 150, 1),
(12, 'Eserine', 'viên', 3000, 2000, 500, 1),
(13, 'Mintacol', 'VỈ', 55000, 50000, 199, 1),
(14, 'Oxytetraciclin', 'lọ', 55000, 500000, 149, 1);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `log`
--

CREATE TABLE `log` (
  `id` int(11) NOT NULL,
  `id_nguoidung` int(11) NOT NULL,
  `TenNguoiDung` varchar(50) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `ThaoTac_ThucHien` varchar(30) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `ChiTiet_ThaoTac` varchar(100) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `ThoiGian_ThucHien` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;

--
-- Đang đổ dữ liệu cho bảng `log`
--

INSERT INTO `log` (`id`, `id_nguoidung`, `TenNguoiDung`, `ThaoTac_ThucHien`, `ChiTiet_ThaoTac`, `ThoiGian_ThucHien`) VALUES
(1, 5, 'Ngô Minh Trọng', 'xóa', 'nguyễn văn anh', '2020-07-12 00:49:13'),
(2, 5, 'Ngô Minh Trọng', 'cập nhật thông tin Bệnh nhân', 'trần văn tiên', '2020-07-12 00:51:10'),
(3, 5, 'Ngô Minh Trọng', 'sửa thuốc', 'Panadol', '2020-07-12 00:58:27'),
(4, 5, 'Ngô Minh Trọng', 'xóa thuốc', 'Panadol', '2020-07-12 00:59:00'),
(5, 5, 'Ngô Minh Trọng', 'Tạo tài khoản mới', 'minhtrongadmin', '2020-07-12 01:12:48'),
(6, 5, 'Ngô Minh Trọng', 'Tạo tài khoản mới', 'phucthaoadmin', '2020-07-12 01:13:30'),
(7, 4, 'Ngô Minh Trọng', 'đổi mật khẩu', 'minhtrong123', '2020-07-12 03:32:39'),
(8, 4, 'Ngô Minh Trọng', 'đổi mật khẩu', 'minhtrong123', '2020-07-12 03:34:25'),
(9, 5, 'Ngô Minh Trọng', 'Tạo tài khoản mới', 'dangkhoa1', '2020-07-12 12:59:28'),
(10, 4, 'Ngô Minh Trọng', 'đổi mật khẩu', 'minhtrong123', '2020-07-12 13:34:58'),
(11, 4, 'Ngô Minh Trọng', 'Tạo tài khoản mới', 'namadmin', '2020-07-12 14:35:40'),
(12, 8, 'trần văn nam', 'đổi mật khẩu', 'namadmin', '2020-07-12 14:37:41'),
(13, 8, 'trần văn nam', 'sửa thuốc', 'panadol3', '2020-07-12 14:38:30'),
(14, 5, 'Ngô Minh Trọng', 'cập nhật thông tin Bệnh nhân', 'nguyễn văn anh', '2020-07-12 14:57:03'),
(15, 5, 'Ngô Minh Trọng', 'Tạo tài khoản mới', 'thanhtu123', '2020-07-12 14:59:55'),
(16, 9, 'lê thanh tú', 'đổi mật khẩu', 'thanhtu123', '2020-07-12 15:00:42'),
(17, 9, 'lê thanh tú', 'cập nhật thông tin Bệnh nhân', 'nguyễn văn anh', '2020-07-12 15:03:08'),
(18, 9, 'lê thanh tú', 'Tạo tài khoản mới', 'tuan123', '2020-07-12 15:04:27'),
(19, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'Hồ Viết Hoàng', '2020-07-19 01:44:49'),
(20, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'lê văn tuấn', '2020-07-19 16:19:14'),
(21, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'ngô minh trọng', '2020-07-19 17:08:57'),
(22, 5, 'Ngô Minh Trọng', 'cập nhật thông tin Bệnh nhân', 'nguyễn văn em', '2020-07-20 02:47:39'),
(23, 0, '', 'Thêm Bệnh nhân mới', 'lê văn vũ', '2020-07-24 00:29:48'),
(24, 0, '', 'Tạo tài khoản mới', 'ronaldo123', '2020-07-24 00:51:03'),
(25, 11, 'Trần Hạo Nam', 'Tạo tài khoản mới', 'duy789', '2020-07-24 00:55:02'),
(26, 5, 'Ngô Minh Trọng', 'sửa thuốc', 'panadol4', '2020-07-31 16:41:21'),
(27, 5, 'Ngô Minh Trọng', 'sửa thuốc', 'becberin', '2020-07-31 16:41:34'),
(28, 5, 'Ngô Minh Trọng', 'sửa thuốc', 'becberin', '2020-07-31 16:42:18'),
(29, 5, 'Ngô Minh Trọng', 'sửa thuốc', 'becberin', '2020-07-31 16:42:42'),
(30, 5, 'Ngô Minh Trọng', 'sửa thuốc', 'becberin', '2020-07-31 16:42:59'),
(31, 5, 'Ngô Minh Trọng', 'sửa thuốc', 'becberin', '2020-07-31 16:43:10'),
(32, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'ngô minh trọng', '2020-07-31 16:58:39'),
(33, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'ngô minh trọng', '2020-07-31 17:00:03'),
(34, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'ngô minh trọng', '2020-07-31 17:01:46'),
(35, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'ngô minh trọng', '2020-07-31 17:07:19'),
(36, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'ngô minh trọng', '2020-07-31 17:11:19'),
(37, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'lê văn sơn', '2020-07-31 17:12:48'),
(38, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'lê văn sơn', '2020-07-31 17:13:56'),
(39, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'ngô minh trọng', '2020-07-31 17:14:05'),
(40, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'nguyễn văn c', '2020-07-31 17:15:29'),
(41, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'Lê Thị Hà Nhôn', '2020-08-02 02:11:16'),
(42, 5, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'LÊ Thanh Tú', '2020-08-14 23:33:36'),
(43, 5, 'Ngô Minh Trọng', 'sửa vật tư', 'Máy đo huyết áp', '2020-09-05 12:13:09'),
(44, 5, 'Ngô Minh Trọng', 'xóa vật tư', 'kính áp tròng', '2020-09-05 12:17:17'),
(45, 5, 'Ngô Minh Trọng', 'xóa vật tư', 'kính áp tròng', '2020-09-05 12:17:32'),
(46, 5, 'Ngô Minh Trọng', 'xóa vật tư', 'kính áp tròng', '2020-09-05 12:17:36'),
(47, 5, 'Ngô Minh Trọng', 'sửa vật tư', 'khẩu trang y tế', '2020-09-05 16:05:37'),
(48, 3, 'Ngô Minh Trọng', 'Tạo tài khoản mới', 'kupingo123', '2020-09-19 04:51:13'),
(49, 3, 'Ngô Minh Trọng', 'Tạo tài khoản mới', 'hoang123', '2020-09-19 08:50:19'),
(50, 3, 'Ngô Minh Trọng', 'Tạo tài khoản mới', 'admin1', '2020-09-20 02:41:04'),
(51, 3, 'Ngô Minh Trọng', 'Tạo tài khoản mới', 'bibo123', '2020-09-20 02:42:09'),
(52, 3, 'Ngô Minh Trọng', 'xóa người dùng', '', '2020-09-20 03:01:29'),
(53, 3, 'Ngô Minh Trọng', 'xóa người dùng', '', '2020-09-20 03:02:49'),
(54, 3, 'Ngô Minh Trọng', 'xóa người dùng', '', '2020-09-20 03:03:14'),
(55, 3, 'Ngô Minh Trọng', 'xóa người dùng', 'Trần Hạo Nam', '2020-09-20 03:05:14'),
(56, 3, 'Ngô Minh Trọng', 'xóa người dùng', 'trần văn nam', '2020-09-20 03:05:26'),
(57, 3, 'Ngô Minh Trọng', 'xóa người dùng', 'trần văn nam', '2020-09-20 03:06:22'),
(58, 3, 'Ngô Minh Trọng', 'xóa người dùng', 'Nguyễn Thành Duy', '2020-09-20 03:06:27'),
(59, 3, 'Ngô Minh Trọng', 'xóa người dùng', 'Ngô Minh Trọng', '2020-09-20 03:07:03'),
(60, 3, 'Ngô Minh Trọng', 'xóa người dùng', 'Ngô Minh Trọng', '2020-09-20 03:08:08'),
(61, 3, 'Ngô Minh Trọng', 'Tạo tài khoản mới', '', '2020-09-20 03:34:26'),
(62, 3, 'Ngô Minh Trọng', 'sửa thông tin người dùng', 'Trần đăng Khoa', '2020-09-20 03:38:37'),
(63, 3, 'Ngô Minh Trọng', 'Thêm Bệnh nhân mới', 'Nguyễn Thị Như', '2020-09-25 14:23:46'),
(64, 3, 'Ngô Minh Trọng', 'xóa người dùng', 'Hồ Viết Hoàng', '2020-09-29 08:40:35'),
(65, 3, 'Ngô Minh Trọng', 'xóa người dùng', 'Ngô Minh Trọng', '2020-09-29 08:40:50');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `nhanvien`
--

CREATE TABLE `nhanvien` (
  `MaNV` int(11) NOT NULL,
  `HoTen` varchar(100) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `NgaySinh` date NOT NULL,
  `SDT` int(11) NOT NULL,
  `ViTri` varchar(255) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `DiaChi` varchar(250) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `EMail` varchar(250) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `UserName` varchar(50) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `PassWord` varchar(50) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `QuyenTruyCap` varchar(40) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `TrangThai` int(11) NOT NULL,
  `Log` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;

--
-- Đang đổ dữ liệu cho bảng `nhanvien`
--

INSERT INTO `nhanvien` (`MaNV`, `HoTen`, `NgaySinh`, `SDT`, `ViTri`, `DiaChi`, `EMail`, `UserName`, `PassWord`, `QuyenTruyCap`, `TrangThai`, `Log`) VALUES
(3, 'Ngô Minh Trọng', '0000-00-00', 849563838, 'Bác sỹ', 'Quỳnh Tân 1 - Buôn Trấp', '', 'admin1', 'e10adc3949ba59abbe56e057f20f883e', 'admin', 0, '0000-00-00 00:00:00'),
(4, 'Ngô Minh Trọng', '0000-00-00', 2147483647, 'Bác Sỹ', 'Đường Nguyễn Văn Cừ, Mỹ Khánh, Phong Điền, Cần Thơ', 'operation@warrantek.com', 'minhtrong123', 'e10adc3949ba59abbe56e057f20f883e', 'nguoidung', 0, '2020-07-12 13:34:57'),
(5, 'Ngô Minh Trọng', '0000-00-00', 849563838, 'Bác Sỹ', 'Quỳnh Tân 1 - Buôn Trấp', 'operation@warrantek.com', 'minhtrongadmin', '827ccb0eea8a706c4c34a16891f84e7b', 'nguoidung', 1, '0000-00-00 00:00:00'),
(8, 'trần văn nam', '0000-00-00', 12222222, 'Quản lý', '34/13 Nguyễn An Ninh,phường EA Tam', 'nam123@gmail.com', 'namadmin', '827ccb0eea8a706c4c34a16891f84e7b', 'admin', 1, '2020-07-12 14:37:41'),
(9, 'lê thanh tú', '0000-00-00', 1233654558, 'Bác Sỹ', 'Quỳnh Tân 1 - Buôn Trấp', 'tu1@gmail.com', 'thanhtu123', 'fcea920f7412b5da7be0cf42b8c93759', 'nguoidung', 1, '2020-07-12 15:00:42'),
(11, 'Trần Hạo Nam', '2020-07-04', 39566334, 'Bác Sỹ', '70 ywang', 'operation@warrantek.com', 'ronaldo123', 'e10adc3949ba59abbe56e057f20f883e', 'nguoidung', 1, '2020-07-24 00:51:03'),
(14, 'Hồ Viết Hoàng', '1997-03-26', 39566333, '', '70 ywang', 'hoangk15@gmail.com', 'hoang123', 'e10adc3949ba59abbe56e057f20f883e', 'nguoidung', 0, '2020-09-19 08:50:19'),
(15, 'lê văn bi', '2002-03-01', 39566334, 'Bác Sỹ', '70 ywang', 'bibo@gmail.com', 'bibo123', 'e10adc3949ba59abbe56e057f20f883e', 'nguoidung', 1, '2020-09-20 02:42:09');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `nhapxuat_khothuo`
--

CREATE TABLE `nhapxuat_khothuo` (
  `Id` int(11) NOT NULL,
  `Id_VatTu` int(11) NOT NULL,
  `Id_nhanvien` int(11) NOT NULL,
  `ThaoTac_NhapXuat` int(11) NOT NULL,
  `ChiTiet_VatTu` int(100) NOT NULL,
  `GhiChu` varchar(250) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `SoLuong` int(11) NOT NULL,
  `NhaPhanPhoi` varchar(250) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `NgayThucHien` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `nhapxuat_khothuoc`
--

CREATE TABLE `nhapxuat_khothuoc` (
  `Id` int(11) NOT NULL,
  `Id_Thuoc` int(11) NOT NULL,
  `Id_nhanvien` int(11) NOT NULL,
  `ThaoTac_NhapXuat` int(11) NOT NULL,
  `ChiTiet_Thuoc` varchar(100) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `GhiChu` varchar(250) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `SoLuong` int(11) NOT NULL,
  `NhaPhanPhoi` varchar(250) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `NgayThucHien` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `vattu`
--

CREATE TABLE `vattu` (
  `id` int(11) NOT NULL,
  `TenVatTu` varchar(255) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `DonViTinh` varchar(30) COLLATE utf8mb4_vietnamese_ci NOT NULL,
  `GiaNhap` int(15) NOT NULL,
  `GiaBan` int(15) NOT NULL,
  `SoLuong` int(10) NOT NULL,
  `TrangThai` int(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_vietnamese_ci;

--
-- Đang đổ dữ liệu cho bảng `vattu`
--

INSERT INTO `vattu` (`id`, `TenVatTu`, `DonViTinh`, `GiaNhap`, `GiaBan`, `SoLuong`, `TrangThai`) VALUES
(1, 'kính áp tròng', 'cái', 600000, 700000, 100, 1),
(2, 'khẩu trang y tế', 'Thùng', 700000, 1500000, 20, 1),
(3, 'Máy đo huyết áp', 'cái', 2000000, 2550000, 50, 1),
(4, 'Dao Mổ', 'cái', 70000, 800000, 100, 1),
(5, 'Tròng chống xước', 'cái', 700000, 750000, 100, 1),
(6, 'Tròng chống bám nước', 'cái', 500000, 600000, 100, 1),
(7, 'Tròng chiết xuất cao', 'cái', 600000, 650000, 100, 1);

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `benhnhan`
--
ALTER TABLE `benhnhan`
  ADD PRIMARY KEY (`MaBN`);

--
-- Chỉ mục cho bảng `donkinh`
--
ALTER TABLE `donkinh`
  ADD PRIMARY KEY (`ID`);

--
-- Chỉ mục cho bảng `donthuoc`
--
ALTER TABLE `donthuoc`
  ADD PRIMARY KEY (`ID`);

--
-- Chỉ mục cho bảng `khothuoc`
--
ALTER TABLE `khothuoc`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `log`
--
ALTER TABLE `log`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `nhanvien`
--
ALTER TABLE `nhanvien`
  ADD PRIMARY KEY (`MaNV`);

--
-- Chỉ mục cho bảng `nhapxuat_khothuoc`
--
ALTER TABLE `nhapxuat_khothuoc`
  ADD PRIMARY KEY (`Id`);

--
-- Chỉ mục cho bảng `vattu`
--
ALTER TABLE `vattu`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `benhnhan`
--
ALTER TABLE `benhnhan`
  MODIFY `MaBN` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=75;

--
-- AUTO_INCREMENT cho bảng `donkinh`
--
ALTER TABLE `donkinh`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT cho bảng `donthuoc`
--
ALTER TABLE `donthuoc`
  MODIFY `ID` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=214;

--
-- AUTO_INCREMENT cho bảng `khothuoc`
--
ALTER TABLE `khothuoc`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT cho bảng `log`
--
ALTER TABLE `log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=66;

--
-- AUTO_INCREMENT cho bảng `nhanvien`
--
ALTER TABLE `nhanvien`
  MODIFY `MaNV` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT cho bảng `nhapxuat_khothuoc`
--
ALTER TABLE `nhapxuat_khothuoc`
  MODIFY `Id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `vattu`
--
ALTER TABLE `vattu`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
